In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
# from config import password
# pd.set_option('display.max_colwidth', None)
import psycopg2

## Merge netflix and omdb csv files

In [2]:
file = "netflix_titles.csv"
netflix_df = pd.read_csv(file)
file = "omdb_list.csv"
omdb_df = pd.read_csv(file)

In [3]:
omdb_df.head()

,Unnamed: 0,title,genre,runtime,imdbRating,imdbVotes,poster,awards,boxoffice,language
0,0,Norm of the North: King Sized Adventure,"Animation, Adventure, Comedy, Family",90 min,3.3,311,https://m.media-amazon.com/images/M/MV5BNjMwZD...,NaN,NaN,English
1,1,Jandino: Whatever it Takes,Comedy,95 min,4.8,23,https://m.media-amazon.com/images/M/MV5BMWE3MG...,NaN,NaN,"English, Dutch"
2,2,Transformers Prime,"Animation, Action, Adventure, Comedy, Drama, F...",30 min,7.9,"5,454",https://m.media-amazon.com/images/M/MV5BMTczND...,14 wins & 26 nominations.,NaN,English
3,3,Transformers: Robots in Disguise,"Animation, Action, Adventure, Comedy, Sci-Fi",22 min,6.0,842,https://m.media-amazon.com/images/M/MV5BMjMwNT...,2 wins & 11 nominations.,NaN,English
4,4,Apaches,Drama,82 min,5.9,292,https://m.media-amazon.com/images/M/MV5BODYyOT...,3 nominations.,NaN,"French, Arabic"

In [4]:
omdb_unique_df = omdb_df.drop_duplicates(subset=['title'])
print(len(omdb_df))
print(len(omdb_unique_df))

5473
5412

In [5]:
merged_df = netflix_df.merge(omdb_unique_df, how="left", on="title")
merged_df['imdbVotes']= merged_df['imdbVotes'].str.replace(',', '')
merged_df['imdbVotes']= merged_df['imdbVotes'].fillna(0)
merged_df['imdbVotes']= merged_df['imdbVotes'].astype(int)
print(len(merged_df))
merged_df.head()

6234

,show_id,type,title,director,cast,country,date_added,release_year,rating,duration,...,description,Unnamed: 0,genre,runtime,imdbRating,imdbVotes,poster,awards,boxoffice,language
0,81145628,Movie,Norm of the North: King Sized Adventure,"Richard Finn, Tim Maltby","Alan Marriott, Andrew Toth, Brian Dobson, Cole...","United States, India, South Korea, China","September 9, 2019",2019,TV-PG,90 min,...,Before planning an awesome wedding for his gra...,0.0,"Animation, Adventure, Comedy, Family",90 min,3.3,311,https://m.media-amazon.com/images/M/MV5BNjMwZD...,NaN,NaN,English
1,80117401,Movie,Jandino: Whatever it Takes,NaN,Jandino Asporaat,United Kingdom,"September 9, 2016",2016,TV-MA,94 min,...,Jandino Asporaat riffs on the challenges of ra...,1.0,Comedy,95 min,4.8,23,https://m.media-amazon.com/images/M/MV5BMWE3MG...,NaN,NaN,"English, Dutch"
2,70234439,TV Show,Transformers Prime,NaN,"Peter Cullen, Sumalee Montano, Frank Welker, J...",United States,"September 8, 2018",2013,TV-Y7-FV,1 Season,...,"With the help of three human allies, the Autob...",2.0,"Animation, Action, Adventure, Comedy, Drama, F...",30 min,7.9,5454,https://m.media-amazon.com/images/M/MV5BMTczND...,14 wins & 26 nominations.,NaN,English
3,80058654,TV Show,Transformers: Robots in Disguise,NaN,"Will Friedle, Darren Criss, Constance Zimmer, ...",United States,"September 8, 2018",2016,TV-Y7,1 Season,...,When a prison ship crash unleashes hundreds of...,3.0,"Animation, Action, Adventure, Comedy, Sci-Fi",22 min,6.0,842,https://m.media-amazon.com/images/M/MV5BMjMwNT...,2 wins & 11 nominations.,NaN,English
4,80125979,Movie,#realityhigh,Fernando Lebrija,"Nesta Cooper, Kate Walsh, John Michael Higgins...",United States,"September 8, 2017",2017,TV-14,99 min,...,When nerdy high schooler Dani finally attracts...,NaN,NaN,NaN,NaN,0,NaN,NaN,NaN,NaN

## Transform netflix genre

In [6]:
# Turn listed_in into list
merged_df.listed_in = merged_df.listed_in.str.split(',').tolist()
listed_df = merged_df.dropna(subset=['listed_in'])
listed_in = listed_df["listed_in"].tolist()

In [7]:
# Loop through listed_in (netflix genre) and get unique values into netflix_genre set
netflix_genre = set()

for movie in listed_in:
    for x in movie:
        netflix_genre.add(x)
print(netflix_genre)

netflix_genre_id = pd.DataFrame(netflix_genre, columns=["netflix_genre"])
netflix_genre_id["netflix_genre"]=netflix_genre_id["netflix_genre"].str.strip()
netflix_genre_id = netflix_genre_id.drop_duplicates()
netflix_genre_id = netflix_genre_id.reset_index()
netflix_genre_id = netflix_genre_id.rename(columns={'index': 'netflix_genre_no'})
print(len(netflix_genre_id))
netflix_genre_id.head()

{' Spanish-Language TV Shows', 'Sports Movies', 'Children & Family Movies', ' TV Dramas', 'Independent Movies', 'TV Horror', ' Classic Movies', ' Cult Movies', 'Music & Musicals', 'International TV Shows', 'Classic Movies', 'Horror Movies', 'TV Sci-Fi & Fantasy', ' Children & Family Movies', ' Dramas', 'TV Action & Adventure', ' Docuseries', 'Anime Series', ' Teen TV Shows', ' Horror Movies', 'Documentaries', 'Classic & Cult TV', ' Classic & Cult TV', ' TV Sci-Fi & Fantasy', ' Independent Movies', ' TV Thrillers', ' Crime TV Shows', 'Romantic Movies', 'Reality TV', ' TV Action & Adventure', 'Docuseries', 'British TV Shows', ' Music & Musicals', ' Sports Movies', ' Documentaries', ' Korean TV Shows', ' TV Mysteries', ' Romantic Movies', ' Faith & Spirituality', ' Anime Features', 'Spanish-Language TV Shows', ' International Movies', "Kids' TV", 'Action & Adventure', 'Dramas', ' Science & Nature TV', 'Anime Features', ' LGBTQ Movies', ' Thrillers', " Kids' TV", ' Stand-Up Comedy', 'Romantic TV Shows', ' Comedies', ' Stand-Up Comedy & Talk Shows', ' Romantic TV Shows', ' Reality TV', 'Stand-Up Comedy', ' TV Comedies', ' TV Horror', 'Cult Movies', 'International Movies', 'Thrillers', 'TV Dramas', 'Crime TV Shows', 'Comedies', 'TV Comedies', 'Stand-Up Comedy & Talk Shows', 'Sci-Fi & Fantasy', 'Movies', ' Sci-Fi & Fantasy', 'TV Shows', ' International TV Shows'}
42

   netflix_genre_no              netflix_genre
0                 0  Spanish-Language TV Shows
1                 1              Sports Movies
2                 2   Children & Family Movies
3                 3                  TV Dramas
4                 4         Independent Movies

In [8]:
# Break out genres (listed_in) with show_id
listed_in_df = merged_df.loc[:,['show_id', 'listed_in']]
listed_in_df = listed_in_df.explode('listed_in')
listed_in_df['listed_in'] = listed_in_df['listed_in'].str.strip()
listed_in_df = listed_in_df.rename(columns={'listed_in': 'netflix_genre'})
print(len(listed_in_df))
listed_in_df.head()

13670

    show_id             netflix_genre
0  81145628  Children & Family Movies
0  81145628                  Comedies
1  80117401           Stand-Up Comedy
2  70234439                  Kids' TV
3  80058654                  Kids' TV

In [9]:
# merge tables to create show_id and genre_id table
netflix_genre_table = listed_in_df.merge(netflix_genre_id,how = "left", on="netflix_genre")
netflix_genre_table = netflix_genre_table.loc[:,['show_id','netflix_genre_no']]
print(len(netflix_genre_table))
netflix_genre_table.head()

13670

    show_id  netflix_genre_no
0  81145628                 2
1  81145628                52
2  80117401                50
3  70234439                42
4  80058654                42

## Transform omdb genre

In [10]:
# Turn genre into list 
merged_df.genre = merged_df.genre.str.split(',').tolist()
genre_df = merged_df.dropna(subset=['genre'])
genre = genre_df["genre"].tolist()

In [11]:
# Loop through genre (omdb genre) and get unique values into omdb_genre set
omdb_genre = set()

for movie in genre:
    for y in movie:
        omdb_genre.add(y)
print(omdb_genre)

omdb_genre_id = pd.DataFrame(omdb_genre, columns=["omdb_genre"])
omdb_genre_id["omdb_genre"]=omdb_genre_id["omdb_genre"].str.strip()
omdb_genre_id = omdb_genre_id.drop_duplicates()
omdb_genre_id = omdb_genre_id.reset_index()
omdb_genre_id = omdb_genre_id.rename(columns={'index': 'omdb_genre_no'})
print(len(omdb_genre_id))
omdb_genre_id.head()

{'Horror', ' Reality-TV', 'Western', ' Action', ' Horror', ' Documentary', 'Comedy', ' Drama', 'Reality-TV', 'Sport', ' Mystery', 'War', 'Animation', ' Comedy', 'Short', 'Family', 'Crime', 'History', ' Talk-Show', ' Music', ' Romance', 'Game-Show', 'Action', 'Biography', 'Talk-Show', ' History', ' Family', 'News', ' Film-Noir', ' News', ' Adventure', ' War', 'Romance', ' Game-Show', 'Adult', 'Musical', ' Musical', 'Documentary', 'Adventure', ' Crime', ' Short', ' Western', 'Mystery', 'Thriller', 'Drama', ' Sci-Fi', ' Animation', 'Fantasy', ' Fantasy', 'Music', 'Sci-Fi', ' Thriller', ' Biography', ' Sport'}
28

   omdb_genre_no   omdb_genre
0              0       Horror
1              1   Reality-TV
2              2      Western
3              3       Action
4              5  Documentary

In [12]:
# Break out genres with show_id
genre_df = merged_df.loc[:,['show_id', 'genre']]
genre_df = genre_df.explode('genre')
genre_df['genre'] = genre_df['genre'].str.strip()
genre_df = genre_df.rename(columns={'genre': 'omdb_genre'})
genre_df.dropna(inplace = True)
print(len(genre_df))
genre_df.head()

13276

    show_id omdb_genre
0  81145628  Animation
0  81145628  Adventure
0  81145628     Comedy
0  81145628     Family
1  80117401     Comedy

In [13]:
# merge tables to create show_id and genre_id table
omdb_genre_table = genre_df.merge(omdb_genre_id,how = "left", on="omdb_genre")
omdb_genre_table = omdb_genre_table.loc[:,['show_id','omdb_genre_no']]
print(len(omdb_genre_table))
omdb_genre_table.head()

13276

    show_id  omdb_genre_no
0  81145628             12
1  81145628             30
2  81145628              6
3  81145628             15
4  80117401              6

## Transform language table

In [14]:
# Turn language into list 
merged_df.language = merged_df.language.str.split(',').tolist()
lan_df = merged_df.dropna(subset=['language'])
language = lan_df["language"].tolist()
print(len(language))

5320

In [15]:
# Loop through language (omdb language) and get unique values into language_set set
language_set = set()

for row in language:
    for i in row:
        language_set.add(i)
print(language_set)

language_df = pd.DataFrame(language_set, columns=["language"])
language_df["language"]=language_df["language"].str.strip()
language_df = language_df.drop_duplicates()
language_df = language_df.reset_index()
language_df = language_df.rename(columns={'index': 'language_no'})
print(len(language_df))
language_df.head()

{' Saami', 'English', ' Latvian', 'Tagalog', ' Uighur', ' Mixtec', ' Awadhi', 'Filipino', ' Thai', ' Chinese', ' Catalan', 'Sanskrit', 'Arabic', 'Yoruba', ' Dutch', 'Sinhalese', 'Wolof', ' Kriolu', ' Sinhalese', ' Polish', 'Persian', ' Tarahumara', 'French', 'Ukrainian', ' Xhosa', 'Greek', ' Khmer', ' Mohawk', ' Swahili', ' Japanese Sign Language', ' Wolof', ' Norwegian', 'Chinese', 'Catalan', 'Turkish', ' Cantonese', ' Egyptian (Ancient)', 'German', ' Lingala', ' Kannada', ' Slovenian', 'Zulu', 'Bhojpuri', ' Hausa', ' American Sign Language', 'Gujarati', 'Ukrainian Sign Language', 'Telugu', 'Hokkien', ' Hungarian', 'Nepali', ' Burmese', ' Turkish', ' Irish', ' Tajik', ' Teochew', ' Latin', 'Hungarian', ' Spanish', ' Urdu', 'Romanian', ' Persian', 'Croatian', ' Telugu', 'Korean', 'Khasi', ' Armenian', 'Japanese', 'Serbo-Croatian', ' Minangkabau', ' Quechua', ' Vietnamese', ' Nyanja', ' Sanskrit', 'Malay', 'Hindi', ' Lithuanian', ' Czech', ' Mapudungun', ' Gujarati', ' Bulgarian', ' Washoe', ' Yoruba', ' Indian Sign Language', ' Ukrainian', 'Polish', ' Yiddish', ' Cheyenne', ' Tamil', 'Tamil', ' Tibetan', ' Cree', ' Icelandic', ' Portuguese', ' Manipuri', ' Akan', 'Bengali', ' Assamese', ' Mongolian', ' Danish', 'Icelandic', ' Estonian', ' Japanese', ' Dari', ' British Sign Language', 'Georgian', ' Serbo-Croatian', ' Afrikaans', ' Marathi', 'Russian', ' Filipino', ' Turkmen', ' Nepali', ' Italian', ' Berber languages', ' Ewe', ' Bable', 'Basque', ' Polynesian', 'Latin', 'Dutch', ' Hokkien', ' Flemish', 'Kannada', 'Serbian', ' Nama', 'Spanish', 'Marathi', ' Finnish', ' Hebrew', 'Portuguese', 'Mandarin', ' Syriac', 'Finnish', ' Old English', ' Arabic', 'Punjabi', 'Kikuyu', 'Shona', 'Flemish', ' Mende', ' Hawaiian', ' French', ' Scottish Gaelic', 'Cantonese', ' Bengali', ' Aragonese', ' German', 'Vietnamese', ' Russian', ' Malayalam', 'Norwegian', ' Chechen', 'American Sign Language', ' Hindi', 'Pushto', ' Romany', ' Tagalog', ' Kurdish', 'Afrikaans', ' Swiss German', ' Romanian', ' Zulu', ' Indonesian', ' Somali', ' Albanian', ' Sindarin', 'Italian', ' Punjabi', 'Danish', ' Amharic', ' Basque', ' Mandarin', ' Serbian', ' Greenlandic', ' Quenya', ' Korean', ' Central American Indian languages', 'Hebrew', ' Ibo', 'Akan', 'None', ' Maori', 'Swedish', ' Southern Sotho', 'Khmer', 'Min Nan', 'Assamese', 'Neapolitan', 'Indonesian', ' Bosnian', ' Swedish', ' Min Nan', ' Aboriginal', ' Croatian', ' Klingon', ' Bhojpuri', 'Bulgarian', ' Malay', ' East-Greenlandic', ' Kazakh', 'Welsh', ' Assyrian Neo-Aramaic', 'Panjabi', 'Oriya', ' Greek', ' English', 'Thai', 'Malayalam', 'Urdu', ' Pushto', 'Slovenian'}
145

   language_no language
0            0    Saami
1            1  English
2            2  Latvian
3            3  Tagalog
4            4   Uighur

In [16]:
# Break out languages with show_id
language_all_df = merged_df.loc[:,['show_id', 'language']]
language_all_df = language_all_df.explode('language')
language_all_df['language'] = language_all_df['language'].str.strip()
language_all_df.dropna(inplace = True)
print(len(language_all_df))
language_all_df.head()

7253

    show_id language
0  81145628  English
1  80117401  English
1  80117401    Dutch
2  70234439  English
3  80058654  English

In [17]:
language_all_df.language.value_counts()

English                    3611
Spanish                     503
Hindi                       494
French                      337
Japanese                    230
                           ...
Assyrian Neo-Aramaic          1
Kazakh                        1
Tajik                         1
Ukrainian Sign Language       1
Hawaiian                      1
Name: language, Length: 145, dtype: int64

In [18]:
# merge tables to create show_id and language_no table
language_table = language_all_df.merge(language_df,how = "left", on="language")
language_table = language_table.loc[:,['show_id','language_no']]
print(len(language_table))
language_table.head()

7253

    show_id  language_no
0  81145628            1
1  80117401            1
2  80117401           14
3  70234439            1
4  80058654            1

## Transform Cast table

In [19]:
# Turn Cast into list 
merged_df.cast = merged_df.cast.str.split(',').tolist()
cast_df = merged_df.dropna(subset=['cast'])
cast = cast_df["cast"].tolist()
print(len(cast))

5664

In [20]:
# Loop through language (omdb language) and get unique values into language_set set
cast_set = set()

for row in cast:
    for i in row:
        cast_set.add(i)
# print(cast_set)

cast_df = pd.DataFrame(cast_set, columns=["cast"])
cast_df["cast"]=cast_df["cast"].str.strip()
cast_df = cast_df.drop_duplicates()
cast_df = cast_df.reset_index()
cast_df = cast_df.rename(columns={'index': 'cast_no'})
print(len(cast_df))
cast_df.head()

27405

   cast_no              cast
0        0     Peter Renaday
1        1         Faiq Asim
2        2      Rena Strober
3        3  Bjarne Henriksen
4        4   Carlo Calderone

In [21]:
# Break out cast with show_id
cast_all_df = merged_df.loc[:,['show_id', 'cast']]
cast_all_df = cast_all_df.explode('cast')
cast_all_df['cast'] = cast_all_df['cast'].str.strip()
cast_all_df = cast_all_df.drop_duplicates()
cast_all_df.dropna(inplace = True)
print(len(cast_all_df))
cast_all_df.head()

44310

    show_id              cast
0  81145628     Alan Marriott
0  81145628       Andrew Toth
0  81145628      Brian Dobson
0  81145628       Cole Howard
0  81145628  Jennifer Cameron

In [22]:
# merge tables to create show_id and language_no table
cast_table = cast_all_df.merge(cast_df,how = "left", on="cast")
cast_table = cast_table.loc[:,['show_id','cast_no']]
print(len(cast_table))
cast_table.head()

44310

    show_id  cast_no
0  81145628    25740
1  81145628     8592
2  81145628    11664
3  81145628     8193
4  81145628     2726

## Transform title table

In [23]:
cast_table_show = cast_table.loc[cast_table.show_id == 81168338]
cast_table_show

       show_id  cast_no
5113  81168338    28207
5114  81168338     7377
5115  81168338    20515
5116  81168338    17521
5117  81168338     8994
5118  81168338     2026
5119  81168338    15490
5120  81168338     8047
5121  81168338     3420

In [29]:
title_df = merged_df.drop(columns=["listed_in","genre","language","Unnamed: 0","cast"])
title_df_show = title_df.loc[title_df.show_id == 81168338]

print(len(title_df))
title_df_show

6234

,show_id,type,title,director,country,date_added,release_year,rating,duration,description,runtime,imdbRating,imdbVotes,poster,awards,boxoffice
777,81168338,Movie,300 Miles to Heaven,Maciej Dejczer,"Denmark, France, Poland","October 1, 2019",1989,TV-14,93 min,"Hoping to help their dissident parents, two br...",105 min,7.2,902,https://m.media-amazon.com/images/M/MV5BYTY1Nz...,4 wins & 4 nominations.,NaN

In [25]:
title_df.country.value_counts()

United States                2032
India                         777
United Kingdom                348
Japan                         176
Canada                        141
                             ...
United Kingdom, Pakistan        1
United Kingdom, Hong Kong       1
Uruguay, Spain, Mexico          1
China, Taiwan                   1
Germany, France, Russia         1
Name: country, Length: 554, dtype: int64

## Load data into postgres using sqlalchemy

In [27]:
# create connection to ETL_project_DB in postgres

connection_string = f"postgres+psycopg2://roo2:123456@netflix.cy8gt7mz64dd.us-east-2.rds.amazonaws.com:5432/postgres"
engine = create_engine(connection_string)

In [28]:
# check table names in database
engine.table_names()

['OMDB_genre',
 'OMDB_title_genre',
 'Title',
 'Netflix_Listed_in',
 'Netflix_title_Listed_in',
 'OMDB_language',
 'OMDB_title_language',
 'cast',
 'title_cast']

In [30]:
# load dataframes into postgres using pandas
title_df.to_sql(name='Title', con=engine, if_exists='append', index=False)

netflix_genre_id.to_sql(name='Netflix_Listed_in', con=engine, if_exists='append', index=False)
netflix_genre_table.to_sql(name='Netflix_title_Listed_in', con=engine, if_exists='append', index=False)

omdb_genre_id.to_sql(name='OMDB_genre', con=engine, if_exists='append', index=False)
omdb_genre_table.to_sql(name='OMDB_title_genre', con=engine, if_exists='append', index=False)

language_df.to_sql(name='OMDB_language', con=engine, if_exists='append', index=False)
language_table.to_sql(name='OMDB_title_language', con=engine, if_exists='append', index=False)

cast_df.to_sql(name='cast', con=engine, if_exists='append', index=False)
cast_table.to_sql(name='title_cast', con=engine, if_exists='append', index=False)

In [ ]:
from sqlalchemy.ext.automap import automap_base

Base = automap_base()
# reflect the tables
Base.prepare(engine=engine, reflect=True)

# new table references
Base.classes.keys()